notes/talks/raku_new_year/c-raku_syntax_vs_perl.org
* raku syntax vs perl
** raku continues to have a perlish feel, but--
*** object method calls via the more standard ".", not the "->"
**** string concationation is now "~" not "."
*** variable names typically have sigils still: $, @, %
**** the @ and % sigils now behave like part of the name, they're invariant:
***** Perl
#+BEGIN_SRC perl
my %fried;
$fried{eggs} = 2;
#+END_SRC 

***** Raku
#+BEGIN_SRC raku
my %fried;
%fried<eggs> = 2;
# alternately
%fried{'eggs'} = 2;
#+END_SRC 

**** you can also have names sans sigils (not done often)
#+BEGIN_SRC raku
my (\i, \j) = (2, 3);
say i + j:  ## 5
#+END_SRC

**** containers
***** typical vars are mutable, and have invisible "containers"
***** vars can contain immutables, bare constants without containers
#+BEGIN_SRC raku
my $var           = 3;
my $sorta_const  := 3;
$var++;           ## Works
$sorta_const++;   ## Error
#+END_SRC
***** a 'scalar' can contain any object, including an aggregate (array, hash, etc)
****** similar to perl's references 


*** everything is an object
**** chains of method calls are common
**** though there are function forms for many methods
*** 
